app/controllers/restaurants_controller.rb

  def create
    Restaurant.create(restaurant_params)
---
INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "KFC"], ["created_at", "2015-10-12 14:36:34.786552"], ["updated_at", "2015-10-12 14:36:34.786552"]]